# if 조건문 사용하기
x = 10
if x == 10:
    print('10입니다.')


x = 10
if (x == 10):
    print('10입니다.')


# if 조건문을 사용할 때 주의할 점
#if x = 10:

#if x == 10


# if 조건문에서 코드를 생략하기
x = 10
if x == 10:
    pass        # TODO: x가 10일 때 처리가 필요함


# if 조건문과 들여쓰기
x = 10
if x == 10:
    print('x에 들어있는 숫자는')
        print('10입니다.')


x = 10
if x == 10:
    print('x에 들어있는 숫자는')
    print('10입니다.')


x = 10
if x == 10:
    print('x에 들어있는 숫자는')
print('10입니다.')


x = 5
if x == 10:
    print('x에 들어있는 숫자는')
print('10입니다.')


# 가능은 하나 관습적으로 x를 앞에 적는
>>> if 10 == x:
...     print('10입니다.')
...
10입니다.
>>> if 10 != x:
...     print('10입니다.')
...
>>>


# 중







